ghi-electronics/TinyCLR-Ports/Targets/STM32F4xx/STM32F4_CAN.cpp
    CAN_TypeDef* CANx = ((controllerIndex == 0) ? CAN1 : CAN2);

    STM32F4_Can_RxMessage rxMessage;

    uint32_t error = CAN_ErrorHandler(controllerIndex);

    uint64_t t;

    STM32F4_Can_Message *can_msg;

    CAN_Receive(CANx, CAN_FIFO0, &rxMessage);

    if (error) {
        raiseErrorEvent = true;
        goto raiseEvent;
    }

    len = rxMessage.DLC;

    if (rxMessage.IDE == CAN_Id_Standard) {
        msgid = rxMessage.StdId;
        extendMode = false;
    }
    else {
        msgid = rxMessage.ExtId;
        extendMode = true;
    }

    rtrmode = (((rxMessage.RTR) & CAN_Rtr_Frame) != 0) ? true : false;

    // Filter
    if (state->canDataFilter.groupFiltersSize || state->canDataFilter.matchFiltersSize) {
        if (state->canDataFilter.groupFiltersSize) {
            if (BinarySearch2(state->canDataFilter.lowerBoundFilters, state->canDataFilter.upperBoundFilters, 0, state->canDataFilter.groupFiltersSize - 1, msgid) >= 0)
                passed = 1;
        }

        if (!passed && state->canDataFilter.matchFiltersSize) {
            if (BinarySearch(state->canDataFilter.matchFilters, 0, state->canDataFilter.matchFiltersSize - 1, msgid) >= 0)
                passed = 1;
        }

        if (!passed) {
            return;
        }
    }

    // timestamp
    t = STM32F4_Time_GetSystemTime(nullptr);

    if (!state->enable) return; // Not copy to internal buffer if enable if off

    if (state->can_rx_count == state->can_rxBufferSize) { // Return if internal buffer is full
        state->errorEvent = 1 << (uint8_t)TinyCLR_Can_Error::BufferFull;
        raiseErrorEvent = true;

        // raise event full, buffer is full, no more data receive.
        goto raiseEvent;
    }
    else if (state->can_rx_count >= state->can_rxBufferSize - CAN_MINIMUM_MESSAGES_LEFT) { // Raise full event soon when internal buffer has only 3 availble msg left
        raiseErrorEvent = true;
        state->errorEvent = 1 << (uint8_t)TinyCLR_Can_Error::BufferFull;
        // No return, continue take CAN_MINIMUM_MESSAGES_LEFT but warning buffer full.
    }

    can_msg = &state->canRxMessagesFifo[state->can_rx_in];

    can_msg->TimeStampL = t & 0xFFFFFFFF;

    can_msg->TimeStampH = t >> 32;

    can_msg->MsgID = msgid;

    can_msg->extendedId = extendMode;

    can_msg->remoteTransmissionRequest = rtrmode;

    if (rtrmode) {
        can_msg->DataA = 0x00000000;
        can_msg->DataB = 0x00000000;
    }
    else {
        can_msg->DataA = rxMessage.Data[0] | (rxMessage.Data[1] << 8) | (rxMessage.Data[2] << 16) | (rxMessage.Data[3] << 24);
        can_msg->DataB = rxMessage.Data[4] | (rxMessage.Data[5] << 8) | (rxMessage.Data[6] << 16) | (rxMessage.Data[7] << 24);
    }

    can_msg->length = len;

    state->can_rx_count++;
    state->can_rx_in++;

    if (state->can_rx_in == state->can_rxBufferSize) {
        state->can_rx_in = 0;
    }

raiseEvent:
    if (raiseErrorEvent)
        STM32F4_Can_EventCallback(state->taskManager, apiManager, state->errorCallbackTaskReference, (void*)state);
    else
        STM32F4_Can_EventCallback(state->taskManager, apiManager, state->messageReceivedCallbackTaskReference, (void*)state);
}

void STM32F4_Can_TxInterruptHandler0(void *param) {
    CAN_ErrorHandler(0);
}

void STM32F4_Can_TxInterruptHandler1(void *param) {
    CAN_ErrorHandler(1);
}

void STM32F4_Can_RxInterruptHandler0(void *param) {
    STM32_Can_RxInterruptHandler(0);
}

void STM32F4_Can_RxInterruptHandler1(void *param) {
    STM32_Can_RxInterruptHandler(1);
}

TinyCLR_Result STM32F4_Can_Acquire(const TinyCLR_Can_Controller* self) {
    if (self == nullptr)
        return TinyCLR_Result::ArgumentNull;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (state->initializeCount == 0) {
        auto controllerIndex = state->controllerIndex;

        if (!STM32F4_GpioInternal_OpenMultiPins(canPins[controllerIndex], 2))
            return TinyCLR_Result::SharingViolation;

        // set pin as analog
        STM32F4_GpioInternal_ConfigurePin(canPins[controllerIndex][CAN_TX_PIN].number, STM32F4_Gpio_PortMode::AlternateFunction, STM32F4_Gpio_OutputType::PushPull, STM32F4_Gpio_OutputSpeed::High, STM32F4_Gpio_PullDirection::PullUp, canPins[controllerIndex][CAN_TX_PIN].alternateFunction);
        STM32F4_GpioInternal_ConfigurePin(canPins[controllerIndex][CAN_RX_PIN].number, STM32F4_Gpio_PortMode::AlternateFunction, STM32F4_Gpio_OutputType::PushPull, STM32F4_Gpio_OutputSpeed::High, STM32F4_Gpio_PullDirection::PullUp, canPins[controllerIndex][CAN_RX_PIN].alternateFunction);

        state->can_rx_count = 0;
        state->can_rx_in = 0;
        state->can_rx_out = 0;
        state->baudrate = 0;
        state->can_rxBufferSize = canDefaultBuffersSize[controllerIndex];
        state->controller = self;
        state->enable = false;

        state->canRxMessagesFifo = nullptr;

        STM32F4_Can_SetReadBufferSize(self, canDefaultBuffersSize[controllerIndex]);

        state->wasDataReceivedCallbackTaskEnqueued = false;
        state->wasErrorCallbackTaskEnqueued = false;

        state->lastReadRxBufferCount = 0;
        state->errorEvent = 0;
        state->lastEventTime = STM32F4_Time_GetCurrentProcessorTime();

        state->errorEventHandler = nullptr;
        state->messageReceivedEventHandler = nullptr;
    }

    state->initializeCount++;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Can_Release(const TinyCLR_Can_Controller* self) {
    if (self == nullptr)
        return TinyCLR_Result::ArgumentNull;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (state->initializeCount == 0) return TinyCLR_Result::InvalidOperation;

    state->initializeCount--;

    if (state->initializeCount == 0) {
        auto controllerIndex = state->controllerIndex;

        self->Disable(self);

        auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

        if (state->canRxMessagesFifo != nullptr) {
            memoryProvider->Free(memoryProvider, state->canRxMessagesFifo);

