ghi-electronics/TinyCLR-Ports/Targets/STM32F4xx/STM32F4_CAN.cpp
            state->canRxMessagesFifo = nullptr;
        }

        STM32F4_GpioInternal_ClosePin(canPins[controllerIndex][CAN_TX_PIN].number);
        STM32F4_GpioInternal_ClosePin(canPins[controllerIndex][CAN_RX_PIN].number);
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Can_WriteMessage(const TinyCLR_Can_Controller* self, const TinyCLR_Can_Message* messages, size_t& len) {
    if (len != 1) return TinyCLR_Result::NotSupported;

    auto& m = messages[0];
    uint32_t arbitrationId = m.ArbitrationId;
    bool isExtendedId = m.IsExtendedId;
    bool isRemoteTransmissionRequest = m.IsRemoteTransmissionRequest;
    const uint8_t* data = m.Data;
    size_t length = m.Length;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (!state->enable) return TinyCLR_Result::InvalidOperation;

    auto controllerIndex = state->controllerIndex;

    uint32_t* data32 = (uint32_t*)data;

    CAN_TypeDef* CANx = ((controllerIndex == 0) ? CAN1 : CAN2);

    uint32_t i = 0;

    uint8_t txmailbox;

    STM32F4_Can_TxMessage txMessage;

    /* Transmit Structure preparation */
    txMessage.RTR = (isRemoteTransmissionRequest == true) ? CAN_Rtr_Frame : 0;

    if (isExtendedId) {
        txMessage.IDE = CAN_Id_Extended;
        txMessage.ExtId = arbitrationId;
    }
    else {
        txMessage.IDE = CAN_Id_Standard;
        txMessage.StdId = arbitrationId;
    }
    txMessage.DLC = length & 0x0F;

    txMessage.Data[0] = ((data32[0] >> 0) & 0xFF);
    txMessage.Data[1] = ((data32[0] >> 8) & 0xFF);
    txMessage.Data[2] = ((data32[0] >> 16) & 0xFF);
    txMessage.Data[3] = ((data32[0] >> 24) & 0xFF);
    txMessage.Data[4] = ((data32[1] >> 0) & 0xFF);
    txMessage.Data[5] = ((data32[1] >> 8) & 0xFF);
    txMessage.Data[6] = ((data32[1] >> 16) & 0xFF);
    txMessage.Data[7] = ((data32[1] >> 24) & 0xFF);

    txmailbox = CAN_Transmit(CANx, &txMessage);

    while (CAN_TransmitStatus(CANx, txmailbox) != CAN_TxStatus_Ok && i++ < CAN_GetTransferTimeout())
        STM32F4_Time_Delay(nullptr, 1);

    if (txmailbox == CAN_TxStatus_NoMailBox || i == CAN_GetTransferTimeout()) {

        CAN_CancelTransmit(CANx, txmailbox);
        CAN_ErrorHandler(controllerIndex);
        return TinyCLR_Result::InvalidOperation;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Can_ReadMessage(const TinyCLR_Can_Controller* self, TinyCLR_Can_Message* messages, size_t& len) {
    if (len != 1) return TinyCLR_Result::NotSupported;

    auto& m = messages[0];
    uint32_t& arbitrationId = m.ArbitrationId;
    bool& isExtendedId = m.IsExtendedId;
    bool& isRemoteTransmissionRequest = m.IsRemoteTransmissionRequest;
    uint8_t* data = m.Data;
    size_t& length = m.Length;
    uint64_t& timestamp = m.Timestamp;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (!state->enable) return TinyCLR_Result::InvalidOperation;

    STM32F4_Can_Message *can_msg;

    uint32_t* data32 = (uint32_t*)data;

    if (state->can_rx_count) {
        can_msg = &state->canRxMessagesFifo[state->can_rx_out];
        state->can_rx_out++;

        if (state->can_rx_out == state->can_rxBufferSize)
            state->can_rx_out = 0;

        arbitrationId = can_msg->MsgID;
        isExtendedId = can_msg->extendedId;
        isRemoteTransmissionRequest = can_msg->remoteTransmissionRequest;
        length = can_msg->length;

        data32[0] = can_msg->DataA;
        data32[1] = can_msg->DataB;

        timestamp = ((uint64_t)can_msg->TimeStampL) | ((uint64_t)can_msg->TimeStampH << 32);

        {
            DISABLE_INTERRUPTS_SCOPED(irq);

            state->can_rx_count--;
            state->lastReadRxBufferCount = state->can_rx_count;
        }
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Can_SetBitTiming(const TinyCLR_Can_Controller* self, const TinyCLR_Can_BitTiming* timing) {
    uint32_t phase1 = (timing->Phase1 + timing->Propagation - 1) & 0x0F;
    uint32_t phase2 = (timing->Phase2 - 1) & 0x07;
    uint32_t baudratePrescaler = (timing->BaudratePrescaler - 1) & 0x03FF;
    uint32_t synchronizationJumpWidth = (timing->SynchronizationJumpWidth - 1) & 0x03;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    state->baudrate = (synchronizationJumpWidth << 24) | (phase2 << 20) | (phase1 << 16) | baudratePrescaler;

    return TinyCLR_Result::Success;
}

size_t STM32F4_Can_GetMessagesToRead(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    return state->can_rx_count;
}

size_t STM32F4_Can_GetMessagesToWrite(const TinyCLR_Can_Controller* self) {
    return 0;
}

bool STM32F4_Can_CanPostEvent(int8_t controllerIndex) {
    auto state = reinterpret_cast<CanState*>(&canStates[controllerIndex]);
    auto currentTime = STM32F4_Time_GetCurrentProcessorTime();
    bool canPost = (currentTime - state->lastEventTime) > CAN_EVENT_POST_DEBOUNCE_TICKS;

    if (canPost) // only update when debounce is over
        state->lastEventTime = currentTime;

    return canPost;
}

TinyCLR_Can_Error STM32F4_Can_GetError(uint32_t error) {
    switch (error) {
    case 1:
        return TinyCLR_Can_Error::Overrun;

    case 4:
        return TinyCLR_Can_Error::BusOff;

    case 8:
        return TinyCLR_Can_Error::Passive;

    default:
        return TinyCLR_Can_Error::BufferFull;
    }
}

void STM32F4_Can_EventCallback(const TinyCLR_Task_Manager* self, const TinyCLR_Api_Manager* apiManager, TinyCLR_Task_Reference task, void* arg) {
    auto state = reinterpret_cast<CanState*>(arg);

    if (task == state->messageReceivedCallbackTaskReference) {
        if (state->can_rx_count > 0 && state->messageReceivedEventHandler != nullptr) {
            auto canPostEvent = STM32F4_Can_CanPostEvent(state->controllerIndex);

            // First byte or canPost, post immediately asap
            if ((state->can_rx_count == 1 && state->lastReadRxBufferCount == 0) || canPostEvent) {
                state->messageReceivedEventHandler(state->controller, state->can_rx_count - state->lastReadRxBufferCount, STM32F4_Time_GetSystemTime(nullptr));

                // Clear for next Enqueue
                state->wasDataReceivedCallbackTaskEnqueued = false;
            }
            else {
                // Couldn't post event on time, scheduel callback to do later.
                if (state->wasDataReceivedCallbackTaskEnqueued == false) {
                    state->taskManager->Enqueue(state->taskManager, task, STM32F4_Time_GetProcessorTicksForTime(nullptr, CAN_EVENT_POST_DEBOUNCE_TICKS));
                    state->wasDataReceivedCallbackTaskEnqueued = true;
                }
            }
        }
    }
    else if (task == state->errorCallbackTaskReference) {
        if (state->errorEvent > 0 && state->errorEventHandler != nullptr) {
            auto canPostEvent = STM32F4_Can_CanPostEvent(state->controllerIndex);

            //If new error detected or called by callback and can post event, post the event.
            if (canPostEvent) {
                auto error = STM32F4_Can_GetError(state->errorEvent);
                state->errorEventHandler(state->controller, error, STM32F4_Time_GetSystemTime(nullptr));

                // Clear error
                state->errorEvent = 0;

                // Clear for next Enqueue
                state->wasErrorCallbackTaskEnqueued = false;
            }
            else {
                // Couldn't post event on time, scheduel callback to do later.
                if (state->wasErrorCallbackTaskEnqueued == false) {
                    state->taskManager->Enqueue(state->taskManager, task, STM32F4_Time_GetProcessorTicksForTime(nullptr, CAN_EVENT_POST_DEBOUNCE_TICKS));

                    state->wasErrorCallbackTaskEnqueued = true;
                }
            }
        }
    }
}

