ghi-electronics/TinyCLR-Ports/Targets/STM32F4xx/STM32F4_CAN.cpp
TinyCLR_Result STM32F4_Can_SetMessageReceivedHandler(const TinyCLR_Can_Controller* self, TinyCLR_Can_MessageReceivedHandler handler) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (handler != nullptr) {
        state->messageReceivedEventHandler = handler;
        state->taskManager = (const TinyCLR_Task_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::TaskManager);
        state->taskManager->Create(state->taskManager, STM32F4_Can_EventCallback, (void*)state, false, state->messageReceivedCallbackTaskReference);
    }

    else {
        if (state->messageReceivedEventHandler != nullptr && state->taskManager != nullptr && state->messageReceivedCallbackTaskReference != nullptr) {
            state->taskManager->Free(state->taskManager, state->messageReceivedCallbackTaskReference);

            state->messageReceivedEventHandler = nullptr;
            state->messageReceivedCallbackTaskReference = nullptr;
        }
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Can_SetErrorReceivedHandler(const TinyCLR_Can_Controller* self, TinyCLR_Can_ErrorReceivedHandler handler) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (handler != nullptr) {
        state->errorEventHandler = handler;
        state->taskManager = (const TinyCLR_Task_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::TaskManager);
        state->taskManager->Create(state->taskManager, STM32F4_Can_EventCallback, (void*)state, false, state->errorCallbackTaskReference);
    }
    else {
        if (state->errorEventHandler != nullptr && state->taskManager != nullptr && state->errorCallbackTaskReference) {
            state->taskManager->Free(state->taskManager, state->errorCallbackTaskReference);

            state->errorEventHandler = nullptr;
            state->errorCallbackTaskReference = nullptr;
        }
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Can_SetExplicitFilters(const TinyCLR_Can_Controller* self, const uint32_t* filters, size_t count) {
    uint32_t*_matchFilters;

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    _matchFilters = (uint32_t*)memoryProvider->Allocate(memoryProvider, count * sizeof(uint32_t));

    if (!_matchFilters)
        return TinyCLR_Result::OutOfMemory;

    memcpy(_matchFilters, filters, count * sizeof(uint32_t));

    std::sort(_matchFilters, _matchFilters + count);

    {
        DISABLE_INTERRUPTS_SCOPED(irq);

        auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);


        state->canDataFilter.matchFiltersSize = count;
        state->canDataFilter.matchFilters = _matchFilters;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Can_SetGroupFilters(const TinyCLR_Can_Controller* self, const uint32_t* lowerBounds, const uint32_t* upperBounds, size_t count) {
    uint32_t* _lowerBoundFilters, *_upperBoundFilters;

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    _lowerBoundFilters = (uint32_t*)memoryProvider->Allocate(memoryProvider, count * sizeof(uint32_t));

    if (!_lowerBoundFilters) {
        return  TinyCLR_Result::OutOfMemory;
    }

    _upperBoundFilters = (uint32_t*)memoryProvider->Allocate(memoryProvider, count * sizeof(uint32_t));

    if (!_upperBoundFilters) {
        memoryProvider->Free(memoryProvider, _lowerBoundFilters);

        return  TinyCLR_Result::OutOfMemory;
    }

    memcpy(_lowerBoundFilters, lowerBounds, count * sizeof(uint32_t));
    memcpy(_upperBoundFilters, upperBounds, count * sizeof(uint32_t));

    bool success = InsertionSort2CheckOverlap(_lowerBoundFilters, _upperBoundFilters, count);

    if (!success) {
        memoryProvider->Free(memoryProvider, _lowerBoundFilters);
        memoryProvider->Free(memoryProvider, _upperBoundFilters);

        return TinyCLR_Result::ArgumentInvalid;
    }

    {
        DISABLE_INTERRUPTS_SCOPED(irq);

        auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

        state->canDataFilter.groupFiltersSize = count;
        state->canDataFilter.lowerBoundFilters = _lowerBoundFilters;
        state->canDataFilter.upperBoundFilters = _upperBoundFilters;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Can_ClearReadBuffer(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    state->can_rx_count = 0;
    state->can_rx_in = 0;
    state->can_rx_out = 0;
    state->lastReadRxBufferCount = 0;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Can_IsWritingAllowed(const TinyCLR_Can_Controller* self, bool& allowed) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    auto controllerIndex = state->controllerIndex;

    CAN_TypeDef* CANx = ((controllerIndex == 0) ? CAN1 : CAN2);

    allowed = false;

    if ((CANx->TSR&CAN_TSR_TME0) == CAN_TSR_TME0 || (CANx->TSR&CAN_TSR_TME1) == CAN_TSR_TME1 || (CANx->TSR&CAN_TSR_TME2) == CAN_TSR_TME2) allowed = true;

    return TinyCLR_Result::Success;
}

size_t STM32F4_Can_GetReadErrorCount(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    auto controllerIndex = state->controllerIndex;

    CAN_TypeDef* CANx = ((controllerIndex == 0) ? CAN1 : CAN2);

    return (size_t)((CANx->ESR & CAN_ESR_REC) >> 24);
}

size_t STM32F4_Can_GetWriteErrorCount(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    auto controllerIndex = state->controllerIndex;

    CAN_TypeDef* CANx = ((controllerIndex == 0) ? CAN1 : CAN2);

    return (size_t)((CANx->ESR & CAN_ESR_REC) >> 16);
}

uint32_t STM32F4_Can_GetSourceClock(const TinyCLR_Can_Controller* self) {
    return STM32F4_APB1_CLOCK_HZ;
}

void STM32F4_Can_Reset() {
    for (int i = 0; i < TOTAL_CAN_CONTROLLERS; i++) {
        STM32F4_Can_Release(&canControllers[i]);

        canStates[i].initializeCount = 0;
        canStates[i].canRxMessagesFifo = nullptr;
    }
}

TinyCLR_Result STM32F4_Can_Enable(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

