ghi-electronics/TinyCLR-Ports/Targets/STM32F4xx/STM32F4_CAN.cpp
    if (state->baudrate == 0) {
        return TinyCLR_Result::InvalidOperation; // Can not enable if baudrate = 0;
    }

    if (!state->enable) {
        auto controllerIndex = state->controllerIndex;

        CAN_TypeDef* CANx = ((controllerIndex == 0) ? CAN1 : CAN2);

        RCC->APB1RSTR |= ((controllerIndex == 0) ? RCC_APB1ENR_CAN1EN : RCC_APB1ENR_CAN2EN);

        STM32F4_Time_Delay(nullptr, 1000);

        RCC->APB1RSTR &= ((controllerIndex == 0) ? ~RCC_APB1ENR_CAN1EN : ~RCC_APB1ENR_CAN2EN);

        RCC->APB1ENR |= ((controllerIndex == 0) ? RCC_APB1ENR_CAN1EN : (RCC_APB1ENR_CAN1EN | RCC_APB1ENR_CAN2EN));

        state->initTypeDef.CAN_TTCM = DISABLE;
        state->initTypeDef.CAN_ABOM = DISABLE;
        state->initTypeDef.CAN_AWUM = DISABLE;
        state->initTypeDef.CAN_NART = DISABLE;
        state->initTypeDef.CAN_RFLM = DISABLE;
        state->initTypeDef.CAN_TXFP = DISABLE;
        state->initTypeDef.CAN_Mode = CAN_Mode_Normal;

        state->initTypeDef.CAN_SJW = ((state->baudrate >> 24) & 0x03);
        state->initTypeDef.CAN_BS2 = ((state->baudrate >> 20) & 0x07);
        state->initTypeDef.CAN_BS1 = ((state->baudrate >> 16) & 0x0F);
        state->initTypeDef.CAN_Prescaler = ((state->baudrate >> 0) & 0x3FF);

        CAN_Initialize(CANx, &state->initTypeDef);

        state->filterInitTypeDef.CAN_FilterNumber = (controllerIndex == 0 ? 0 : 14);

        state->filterInitTypeDef.CAN_FilterMode = CAN_FilterMode_IdMask;
        state->filterInitTypeDef.CAN_FilterScale = CAN_FilterScale_32bit;
        state->filterInitTypeDef.CAN_FilterIdHigh = 0x0000;
        state->filterInitTypeDef.CAN_FilterIdLow = 0x0000;
        state->filterInitTypeDef.CAN_FilterMaskIdHigh = 0x0000;
        state->filterInitTypeDef.CAN_FilterMaskIdLow = 0x0000;
        state->filterInitTypeDef.CAN_FilterFIFOAssignment = 0;
        state->filterInitTypeDef.CAN_FilterActivation = ENABLE;

        CAN_FilterInit(&state->filterInitTypeDef);

        if (controllerIndex == 0) {
            STM32F4_InterruptInternal_Activate(CAN1_TX_IRQn, (uint32_t*)&STM32F4_Can_TxInterruptHandler0, 0);
            STM32F4_InterruptInternal_Activate(CAN1_RX0_IRQn, (uint32_t*)&STM32F4_Can_RxInterruptHandler0, 0);
        }
        else {
            STM32F4_InterruptInternal_Activate(CAN2_TX_IRQn, (uint32_t*)&STM32F4_Can_TxInterruptHandler1, 0);
            STM32F4_InterruptInternal_Activate(CAN2_RX0_IRQn, (uint32_t*)&STM32F4_Can_RxInterruptHandler1, 0);
        }

        CANx->IER |= (CAN_IT_FMP0 | CAN_IT_FF0 | CAN_IT_FOV0 | CAN_IT_EWG | CAN_IT_EPV | CAN_IT_BOF | CAN_IT_LEC | CAN_IT_ERR);

        state->enable = true;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Can_Disable(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    if (state->enable) {
        auto controllerIndex = state->controllerIndex;

        CAN_TypeDef* CANx = ((controllerIndex == 0) ? CAN1 : CAN2);

        CANx->IER &= ~(CAN_IT_FMP0 | CAN_IT_FF0 | CAN_IT_FOV0 | CAN_IT_EWG | CAN_IT_EPV | CAN_IT_BOF | CAN_IT_LEC | CAN_IT_ERR);

        RCC->APB1ENR &= ((controllerIndex == 0) ? ~RCC_APB1ENR_CAN1EN : ~RCC_APB1ENR_CAN2EN);

        if (controllerIndex == 0) {
            STM32F4_InterruptInternal_Deactivate(CAN1_TX_IRQn);
            STM32F4_InterruptInternal_Deactivate(CAN1_RX0_IRQn);
        }
        else {
            STM32F4_InterruptInternal_Deactivate(CAN2_TX_IRQn);
            STM32F4_InterruptInternal_Deactivate(CAN2_RX0_IRQn);
        }

        state->enable = false;
    }

    return TinyCLR_Result::Success;
}

bool STM32F4_Can_CanWriteMessage(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    bool canWrite;

    STM32F4_Can_IsWritingAllowed(self, canWrite);
    return (state->enable && canWrite);
}

bool STM32F4_Can_CanReadMessage(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    return (state->enable);
}
#endif // INCLUDE_CAN
